/**
 * Author LLJ
 * Date 2016-5-17 17:32
 */
var tar = [
    {
        "result": [
            "男",
            "女",
            "无值",
            "不限"
        ],
        "name": "性别"
    },
    {
        "result": [
            "小于18",
            "18-25",
            "26-30",
            "31-35",
            "35-40",
            "41-50",
            "51-60",
            "60+",
            "无值",
            "不限"
        ],
        "name": "年龄"
    },
    {
        "result": [
            "父亲",
            "母亲",
            "(外)祖父母",
            "其他",
            "无值",
            "不限"
        ],
        "name": "家庭角色"
    },
    {
        "result": [
            "已婚",
            "单身",
            "无值",
            "不限"
        ],
        "name": "婚姻状况"
    },
    {
        "result": [
            "0-5万",
            "5-10万",
            "10-20万",
            "20-40万",
            "40万以上",
            "无值",
            "不限"
        ],
        "name": "个人年收入范围"
    },
    {
        "result": [
            "1",
            "2",
            "3",
            "4~5",
            "6及以上",
            "无值",
            "不限"
        ],
        "name": "家庭人口数量"
    },
    {
        "result": [
            "0-5万",
            "5-10万",
            "10-20万",
            "20-40万",
            "40万以上",
            "无值",
            "不限"
        ],
        "name": "家庭收入范围"
    },
    {
        "result": [
            "备孕",
            "孕早期",
            "孕中期",
            "孕晚期",
            "已育",
            "无值",
            "不限"
        ],
        "name": "孕产状态"
    },
    {
        "result": [
            "1",
            "2",
            "3及以上",
            "无值",
            "不限"
        ],
        "name": "宝宝数量"
    },
    {
        "result": [
            "0-6月",
            "7-12月",
            "1-2岁",
            "2-3岁",
            "4-6岁",
            "6岁及以上",
            "无值",
            "不限"
        ],
        "name": "宝宝年龄"
    },
    {
        "result": [
            "男",
            "女",
            "无值",
            "不限"
        ],
        "name": "宝宝性别"
    },
    {
        "result": [
            "VIP",
            "高级",
            "普通",
            "无值",
            "不限"
        ],
        "name": "会员级别"
    },
    {
        "result": [
            "新",
            "活跃",
            "睡眠",
            "流失",
            "无值",
            "不限"
        ],
        "name": "会员生命周期定义"
    },
    {
        "result": [
            "0-100",
            "100-500",
            "500-1000",
            "1000-5000",
            "5000-10000",
            "10000+",
            "无值",
            "不限"
        ],
        "name": "会员积分余额"
    },
    {
        "result": [
            "1000积分兑换奶瓶",
            "2000积分兑换高级奶粉",
            "5000积分兑换儿童汽车",
            "无值",
            "不限"
        ],
        "name": "会员可兑换权益"
    },
    {
        "result": [
            "是",
            "否",
            "无值",
            "不限"
        ],
        "name": "是否曾兑换过积分"
    },
    {
        "result": [
            "北京市",
            "上海市",
            "天津市",
            "河北省石家庄",
            "河北省秦皇岛岁",
            "河北省廊坊",
            "辽宁省沈阳",
            "陕西省西安",
            "陕西省咸阳",
            "四川省成都",
            "四川省绵阳",
            "山东省青岛",
            "山东省潍坊",
            "山东省济南",
            "湖北省武汉",
            "无值",
            "不限"
        ],
        "name": "居住位置"
    },
    {
        "result": [
            "北京市",
            "上海市",
            "天津市",
            "河北省石家庄",
            "河北省秦皇岛岁",
            "河北省廊坊",
            "辽宁省沈阳",
            "陕西省西安",
            "陕西省咸阳",
            "四川省成都",
            "四川省绵阳",
            "山东省青岛",
            "山东省潍坊",
            "山东省济南",
            "湖北省武汉",
            "无值",
            "不限"
        ],
        "name": "工作位置"
    },
    {
        "result": [
            "北京市天香居",
            "上海市听雨轩",
            "天津市缥缈楼",
            "河北省石家庄卧龙居",
            "河北省秦皇岛神凤阁",
            "河北省廊坊玄武厅",
            "辽宁省沈阳轩辕居",
            "陕西省西安倚天阁",
            "陕西省咸阳闻香楼",
            "四川省成都静雅斋",
            "四川省绵阳明月厅",
            "山东省青岛清风店",
            "山东省潍坊蕴英阁",
            "山东省济南晨露居",
            "湖北省武汉童心坊",
            "无值",
            "不限"
        ],
        "name": "距离最近的接触点"
    },
    {
        "result": [
            "孕妇及妈妈用品-妈妈营养",
            "孕妇及妈妈用品-妈妈护肤",
            "孕妇及妈妈用品-妈妈用品",
            "孕妇及妈妈用品-哺乳用品",
            "孕妇及妈妈用品-服装服饰",
            "宝宝营养品-奶粉",
            "宝宝营养品-辅食",
            "宝宝营养品-营养品",
            "宝宝穿靓装-婴装",
            "宝宝穿靓装-童装",
            "宝宝穿靓装-童袜",
            "宝宝穿靓装-童鞋",
            "无值",
            "不限"
        ],
        "name": "曾购买的品类"
    },
    {
        "result": [
            "惠氏",
            "美赞臣",
            "雀巢",
            "伊利",
            "雅培",
            "十月天使",
            "开丽",
            "美德乐",
            "大卫",
            "纽澈",
            "嘉宝",
            "英氏",
            "歌瑞贝儿",
            "歌瑞贝儿",
            "韦特儿vitalBaby",
            "无值",
            "不限"
        ],
        "name": "曾购买的品牌"
    },
    {
        "result": [
            "官网",
            "APP",
            "wechat微店",
            "乐海淘",
            "京东",
            "亚马逊",
            "其他电商平台",
            "乐友孕婴童连锁店（自营）",
            "乐友孕婴童连锁店（加盟）",
            "无值",
            "不限"
        ],
        "name": "曾购买的渠道"
    },
    {
        "result": [
            "1周内",
            "1-3周",
            "3-4周",
            "一月以上",
            "无值",
            "不限"
        ],
        "name": "最近一次购买间隔"
    },
    {
        "result": [
            "孕妇及妈妈用品-妈妈营养",
            "孕妇及妈妈用品-妈妈护肤",
            "孕妇及妈妈用品-妈妈用品",
            "孕妇及妈妈用品-哺乳用品",
            "孕妇及妈妈用品-服装服饰",
            "宝宝营养品-奶粉",
            "宝宝营养品-辅食",
            "宝宝营养品-营养品",
            "宝宝穿靓装-婴装",
            "宝宝穿靓装-童装",
            "宝宝穿靓装-童袜",
            "宝宝穿靓装-童鞋",
            "无值",
            "不限"
        ],
        "name": "最近一次购买的品类"
    },
    {
        "result": [
            "惠氏",
            "美赞臣",
            "雀巢",
            "伊利",
            "雅培",
            "十月天使",
            "开丽",
            "美德乐",
            "大卫",
            "纽澈",
            "嘉宝",
            "英氏",
            "歌瑞贝儿",
            "歌瑞贝儿",
            "韦特儿vitalBaby",
            "无值",
            "不限"
        ],
        "name": "最近一次购买的品牌"
    },
    {
        "result": [
            "官网",
            "APP",
            "wechat微店",
            "乐海淘",
            "京东",
            "亚马逊",
            "其他电商平台",
            "乐友孕婴童连锁店（自营）",
            "乐友孕婴童连锁店（加盟）",
            "无值",
            "不限"
        ],
        "name": "最近一次购买的渠道"
    },
    {
        "result": [
            "0-5K",
            "5k-10K",
            "1W-2W",
            "2W-5W",
            "5W以上",
            "无值",
            "不限"
        ],
        "name": "总交易金额"
    },
    {
        "result": [
            "高",
            "中",
            "低",
            "无值",
            "不限"
        ],
        "name": "总交易频次"
    },
    {
        "result": [
            "0-10次",
            "10次-20次",
            "20-50次",
            "50-100次",
            "100次以上",
            "无值",
            "不限"
        ],
        "name": "总交易数量"
    },
    {
        "result": [
            "0-50元",
            "50-100元",
            "100-200元",
            "200-500元",
            "500-1000元",
            "1000元以上",
            "无值",
            "不限"
        ],
        "name": "客单价"
    },
    {
        "result": [
            "1K以下",
            "1K-2K",
            "2K-5K",
            "5K以上",
            "无值",
            "不限"
        ],
        "name": "年均交易金额"
    },
    {
        "result": [
            "高",
            "中",
            "低",
            "无值",
            "不限"
        ],
        "name": "年均交易频次"
    },
    {
        "result": [
            "50次以下",
            "50-100次",
            "100-150次",
            "150-200次",
            "200-300次",
            "300次以上",
            "无值",
            "不限"
        ],
        "name": "年均交易数量"
    },
    {
        "result": [
            "孕妇及妈妈用品-妈妈营养",
            "孕妇及妈妈用品-妈妈护肤",
            "孕妇及妈妈用品-妈妈用品",
            "孕妇及妈妈用品-哺乳用品",
            "孕妇及妈妈用品-服装服饰",
            "宝宝营养品-奶粉",
            "宝宝营养品-辅食",
            "宝宝营养品-营养品",
            "宝宝穿靓装-婴装",
            "宝宝穿靓装-童装",
            "宝宝穿靓装-童袜",
            "宝宝穿靓装-童鞋",
            "无值",
            "不限"
        ],
        "name": "购买品类偏好"
    },
    {
        "result": [
            "惠氏",
            "美赞臣",
            "雀巢",
            "伊利",
            "雅培",
            "十月天使",
            "开丽",
            "美德乐",
            "大卫",
            "纽澈",
            "嘉宝",
            "英氏",
            "歌瑞贝儿",
            "歌瑞贝儿",
            "韦特儿vitalBaby",
            "无值",
            "不限"
        ],
        "name": "购买品牌偏好"
    },
    {
        "result": [
            "官网",
            "APP",
            "wechat微店",
            "乐海淘",
            "京东",
            "亚马逊",
            "其他电商平台",
            "乐友孕婴童连锁店（自营）",
            "乐友孕婴童连锁店（加盟）",
            "无值",
            "不限"
        ],
        "name": "渠道偏好"
    },
    {
        "result": [
            "高",
            "中",
            "低",
            "无值",
            "不限"
        ],
        "name": "购买产品档次偏好"
    },
    {
        "result": [
            "移动端",
            "PC端",
            "无值",
            "不限"
        ],
        "name": "设备偏好"
    },
    {
        "result": [
            "优惠券",
            "买赠",
            "折扣",
            "包邮",
            "其他电商平台",
            "无值",
            "不限"
        ],
        "name": "促销机制偏好"
    },
    {
        "result": [
            "是",
            "否",
            "无值",
            "不限"
        ],
        "name": "曾经投诉"
    },
    {
        "result": [
            "是",
            "否",
            "无值",
            "不限"
        ],
        "name": "曾经退换货"
    },
    {
        "result": [
            "十月天使",
            "开丽",
            "纽澈",
            "惠氏",
            "美赞臣",
            "雀巢",
            "无值",
            "不限"
        ],
        "name": "曾经中/差评的品牌"
    },
    {
        "result": [
            "短信",
            "EDM",
            "直邮",
            "官网",
            "APP",
            "乐友孕婴童企业服务号",
            "乐友孕婴童订阅号(各分公司)",
            "乐友导购自营微信群",
            "乐友孕婴童官方微博",
            "淘宝旺旺",
            "媒体投放",
            "无值",
            "不限"
        ],
        "name": "可选择的接触点"
    },
    {
        "result": [
            "短信",
            "EDM",
            "直邮",
            "官网",
            "APP",
            "乐友孕婴童企业服务号",
            "乐友孕婴童订阅号(各分公司)",
            "乐友导购自营微信群",
            "乐友孕婴童官方微博",
            "淘宝旺旺",
            "媒体投放",
            "无值",
            "不限"
        ],
        "name": "用户招募来源"
    },
    {
        "result": [
            "短信",
            "EDM",
            "直邮",
            "官网",
            "APP",
            "乐友孕婴童企业服务号",
            "乐友孕婴童订阅号(各分公司)",
            "乐友导购自营微信群",
            "乐友孕婴童官方微博",
            "淘宝旺旺",
            "媒体投放",
            "无值",
            "不限"
        ],
        "name": "曾经互动的平台"
    },
    {
        "result": [
            "周末大促销",
            "国庆狂欢",
            "满月宴请",
            "中秋团圆",
            "合家欢乐年",
            "无值",
            "不限"
        ],
        "name": "曾经参与的活动"
    },
    {
        "result": [
            "短信",
            "EDM",
            "直邮",
            "官网",
            "APP",
            "乐友孕婴童企业服务号",
            "乐友孕婴童订阅号(各分公司)",
            "乐友导购自营微信群",
            "乐友孕婴童官方微博",
            "淘宝旺旺",
            "媒体投放",
            "无值",
            "不限"
        ],
        "name": "最近一次互动的平台"
    },
    {
        "result": [
            "周末大促销",
            "国庆狂欢",
            "满月宴请",
            "中秋团圆",
            "合家欢乐年",
            "无值",
            "不限"
        ],
        "name": "最近一次参与的活动"
    },
    {
        "result": [
            "高",
            "中",
            "低",
            "沉睡",
            "无值",
            "不限"
        ],
        "name": "用户活跃度"
    },
    {
        "result": [
            "短信",
            "EDM",
            "直邮",
            "官网",
            "APP",
            "乐友孕婴童企业服务号",
            "乐友孕婴童订阅号(各分公司)",
            "乐友导购自营微信群",
            "乐友孕婴童官方微博",
            "淘宝旺旺",
            "媒体投放",
            "无值",
            "不限"
        ],
        "name": "触达渠道偏好"
    },
    {
        "result": [
            "短信",
            "EDM",
            "直邮",
            "官网",
            "APP",
            "乐友孕婴童企业服务号",
            "乐友孕婴童订阅号(各分公司)",
            "乐友导购自营微信群",
            "乐友孕婴童官方微博",
            "淘宝旺旺",
            "媒体投放",
            "无值",
            "不限"
        ],
        "name": "互动渠道偏好"
    },
    {
        "result": [
            "移动端",
            "PC端",
            "无值",
            "不限"
        ],
        "name": "设备偏好"
    },
    {
        "result": [
            "讲座",
            "优惠促销",
            "宝宝玩",
            "家长线下联谊会",
            "无值",
            "不限"
        ],
        "name": "互动机制偏好"
    },
    {
        "result": [
            "高",
            "中",
            "低",
            "无值",
            "不限"
        ],
        "name": "交易价值细分"
    },
    {
        "result": [
            "成为会员",
            "购物",
            "听微信讲座",
            "反馈产品使用效果",
            "无值",
            "不限"
        ],
        "name": "用户行为细分"
    },
    {
        "result": [
            "高",
            "中",
            "低",
            "无值",
            "不限",
            "无值",
            "不限"
        ],
        "name": "用户口碑价值细分"
    },
    {
        "result": [
            "孕妇及妈妈用品-服装服饰",
            "宝宝营养品-奶粉",
            "宝宝用什么-寝具用品",
            "无值",
            "不限"
        ],
        "name": "很可能购买的品类"
    },
    {
        "result": [
            "伊利",
            "嘉宝",
            "歌瑞贝儿",
            "无值",
            "不限"
        ],
        "name": "很可能购买的品牌"
    },
    {
        "name": "自定义",
        "result": [
            "新产品尝鲜用户",
            "口碑传播用户",
            "新产品首发购买用户",
            "新产品满意用户"
        ]
    }
];
var sum={
    groups:[
        {
            conditions:[{tag_id: 5869, tag_group_id: 14069, tag_name: "自然人属性-个人信息-性别-男", exclude: 0},{tag_id: 5873, tag_group_id: 14073, tag_name: "自然人属性-个人信息-年龄段-90后", exclude: 0}]
        },
        {
            conditions:[{tag_id: 6218, tag_group_id: 14427, tag_name: "自然人属性-地理区域-市-天津市", exclude: 0}]
        },
        {
            conditions:[{tag_id: 0, tag_group_id: 14868, tag_name: "品牌联系强度-用户流失概率-支付状态-null", exclude: 0},{tag_id: 6651, tag_group_id: 14872, tag_name: "品牌联系强度-用户流失概率-是否购买用户-是", exclude: 0}]
        }
    ]
};
module.exports.tag = tar;
